alert ("Привет, Макс! Это я Дима, я копирую свое сознание в компуктер и это первое, что мне удалось перенести в него. 25 октября нас ждет полет в Питер, чтобы изменить нашу жизнь к лучшему и жить так как мы мечтали. Для этого нужно накопить 150.000 рублей. Мой разум способен расчитать сколько нужно откладывать в день, чтобы успеть накопить эту сумму. Просто вставь в меня.. данные, и ответь на несколько вопросов!");

let money = +prompt("Сколько бабла зарабатываешь в месяц?");
    time = prompt("Какая сегодня дата? Напиши в формате YYYY-MM-DD");

let bigData = {
    budget: money,
    timeData: time,
    expenses: {},
    
}

let a = +prompt ("Сколько денег в месяц тебе нужно тратить на необходимое?");

alert ("Ща погоди");

let calculate = ((money - a)/30);
    targer = calculate*240;
    if (targer >= 150000) {
    alert(calculate + " Этих ежедневных сбережений хватит на то, чтобы накопить " + calculate*240 +  " рублей");
    }else {
    alert(calculate + " Этих ежедневных сбережений не хватит на то, чтобы накопить " + calculate*240 + " рублей, этого недостаточно! Увеличь доходы, либо экономь расходы, опять на копик все тратишь?");
    };

    alert("Все, я спать пацаны")
